Revit 2027 API
Application.GetRevitServerNetworkHosts Method
 Gets the list of all Revit Server Network hosts in current session.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<string> GetRevitServerNetworkHosts()
Public Function GetRevitServerNetworkHosts As IList(Of String)
public:
IList<String^>^ GetRevitServerNetworkHosts()
member GetRevitServerNetworkHosts : unit -> IList<string>
Return Value
IList<String>
 An array of names of all Revit Server Network hosts in current session.
Remarks
 The list of Revit Server Network hosts is stored externally in the RSN[version].ini file.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace